<template>
	<div class="bot-scheme-editor-list-block">
		<bot-scheme-compound-editor-list-item-button :title="delete_label" icon_image="/images/bot-scheme-toolbar/delete32.png"></bot-scheme-compound-editor-list-item-button>
		<bot-scheme-compound-editor-list-item-button :title="edit_label" icon_image="/images/bot-scheme-toolbar/edit32.png"></bot-scheme-compound-editor-list-item-button>
		{{ content }}
	</div>
</template>
<script>	
    /**
     * Этот комонент может быть сконфигурирован как для редактора блока условий, так и для редактора блока действий
    */
	export default {
		name: 'botSchemeCompoundEditor',

		//Аргументы (html атрибуты) извне
		props:{
            /** @property {String} edit_label Метка для действия Редактировать */
			edit_label: {
				type: String,
				default: 'Edit'
			},
			/** @property {String} delete_label Метка для действия Удалить */
			delete_label: {
				type: String,
				default: 'Delete'
			}
		},

		components: {
			'bot-scheme-compound-editor-list-item-button': require('./botSchemeCompoundEditorListItemButton').default
		},



		//вызывается раньше чем mounted
		data: function(){return {
			/** @property {String} content текст элемента списка */
			content : ` Товарищи! сложившаяся структура организации в значительной степени обуславливает создание позиций, занимаемых участниками в отношении поставленных задач. Не следует, однако забывать, что укрепление и развитие структуры влечет за собой процесс внедрения и модернизации направлений прогрессивного развития. Равным образом реализация намеченных плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач.

Значимость этих проблем настолько очевидна, что рамки и место обучения кадров позволяет выполнять важные задания по разработке направлений прогрессивного развития. Значимость этих проблем настолько очевидна, что начало повседневной работы по формированию позиции обеспечивает широкому кругу (специалистов) участие в формировании существенных финансовых и административных условий. Задача организации, в особенности же консультация с широким активом влечет за собой процесс внедрения и модернизации позиций, занимаемых участниками в отношении поставленных задач. Идейные соображения высшего порядка, а также новая модель организационной деятельности в значительной степени обуславливает создание модели развития. Равным образом укрепление и развитие структуры обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. `,

			
		}; },
		//
		methods:{
			/**
			 * @description Обработка клика на кнопке "Сохранить"
			*/
			on(event) {
				
			},
			
			
		},//end methods
		//вызывается после data, поля из data видны "напрямую" как this.fieldName
		mounted() {

		}
	}
</script>